app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "body", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @comment = @article.comments.new(params[:comment])
    if @comment.save